app/controllers/users_controller.rb

INSERT INTO "users" ("fname", "b_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["fname", "qwe"], ["b_name", "qwe business"], ["created_at", "2022-02-09 06:03:54.209817"], ["updated_at", "2022-02-09 06:03:54.209817"]]
---
    def create
      @user = User.new(user_params)
      first_name = @user.fname
      business_name = @user.b_name
      User.user_data(@user, first_name, business_name)

      if @user.save

UPDATE "users" SET "fname" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["fname", "vfjnjuntgn"], ["updated_at", "2022-02-10 05:35:18.633462"], ["id", 4]]
---
    def update
      if @user.update(user_params)